[601]
18=Отблагодарить автора мода
19=Поддержка
20=Темы
21=Загрузить
2=ЛОГ БОТА
3=Стиль
4=Используйте эти опции, чтобы установить тип лога.
5=Ручное разделение
6=Лог бота и атаки одинакого размера
7=Большой лог бота, маленький лог атаки
8=Маленький лог бота, большой лог атаки
9=Полный лог бота,скрыть лог атаки
10=Скрыть лог бота, полный лог атаки
11=Очистить лог
12=Используйте это, чтобы очистить лог атаки.
13=Копировать лог
14=Используйте это, чтобы скопировать лог атаки в буфер обмена (CTRL+C)
15=ЛОГ АТАКИ
16="                   --------  ЛУТ  --------                       ----- БОНУС ------"
17="ВРЕМЯ|ТРОФ| ПОИСК| ЗОЛОТО|ЭЛИКСИР|Ч.Эликc|ТРОФ|С|ЗОЛОТО|ЭЛИКСИР|Ч.Э|Л."
20=Themes
21=Load Theme

[602]
0=-https://vk.com/clashbots-
1=Старт 
2=Стоп
3=Пауза
4=Используйте это, чтобы приостановить все действия бота до выхода.
5=Возобновить
6=Используйте это, чтобы возобновить работу бота.
7=Режим поиска
8=Не атакует. Ищёт базы отвечающие условиям.
9=Фото
10=Нажмите сюда, чтобы сделать snaphot вашей деревни и сохранить его в файл.
11=Скрыть
12=Используйте это, чтобы скрыть окно.
13=(Не сворачивается, но скрыт)
14=Фоновый режим
16=Установите этот флажок, чтобы включить фоновый режим бота.
17=При этом вы можете также скрыть окно с bluestacks.
18=МБ Атака!
19=ЖБ Атака!
20=ТХ Снайп!
25=Профиль
22=Инфа о деревне
23=появится здесь
24=после запуска.
26=Показ
27=Окно
29=Используйте эту функцию, чтобы встроить Эмулятор в окно бота.
30=Use this to START the bot.
31=Use this to STOP the bot (or ESC key).

[603]
32=Деревня
30=Только в эти часы суток
2=Выделить/отменить всё
3=AM
4=PM
1=Ничего
0=Ничего
14=Часов
15=Час
6=сек.
5=поиск(ов).
31=Атака только в эти дни недели
16=В
17=Воскресенье
18=П
19=Понедельник
20=В
21=Вторник
22=С
23=Среда
24=Ч
25=Четверг
26=П
27=Пятница
28=С
29=Суббота
13=-
12=%
8=секунды
7=секунд
37=час
36=День:
35=Час:
10=min.
41=Skip donation near full troops
39=Skip donation near full troops
40=if troops army camps are greater than

[600]
11=Запрос Войск
12=Донат 
13=Расписание 
14=Лабратория
15=Герои
16=Здания
17=Стены
18=PushBullet
19=Справка
6=Разное
7=Донат
8=Апгрейд
9=Достижения
10=Оповещение
20=Войска
21=Заклинания
22=Буст
44=A - Сооружения
45=B - Условия
46=C - Атака
47=D - После Milking атаки
48=Расширенный
28=Поиск
29=Атака
30=Конец Боя
31=Коллекторы
32=Трофеи
23=МБаза
49=Примечание: Эта стратегия отключена, отметьте флажок 
50=
24=ЖБаза
25=ТХ Снайп
26=Хулиган
27=Опции
33=Загр Стратегию
34=Сохранить Стратегию
41=Бараки
42=Поиск и Атака
43=Стратегии
38=Прибыль
39=Разное
40=Атаки
35=Эксперт
51=Отладка
36=Профиль
37=Лут
1=Лог
2=Деревня
3=Атака
4=Бот
52=Моды
5=О нас

[611]
1=Войска кланового замка
2=Запрос войск / Заклинаний
3=Что-нибудь, пожалуйста,
4=Этот текст используется для запроса войск в чате
5=Запрос в начале
6=Запрос войска при запуске бота

[604]
1=Варвары
2=Луки
3=Гиганты
4=Гоблины
5=Бомберы
7=Шары
8=Маги
9=Хилка
10=Драконы
11=П.E.K.K.A.
13=Миньёны
14=Кабаны
15=Валька
16=Големы
17=Ведьма
18=Ад.Гончая
19=Вышибала
20=Дракончик
21=Шахтёр

[612]
23=Черный список
24=Польз.войска
27=Донат
28=
29=Пожертвовать всем
31=Игнорировать другие запросы
32=Ключевые слова для доната:
33=Не давать по этим ключевым словам
34=Черный список для пожертвования
81=Донатить, если ключевые слова соответствуют запросу
82=Для всех чат запросов
22=Меню выбора войск для доната
25=Включить распознавание кириллицы
26=Для запросов и доната на русском языке включите эту опцию.
35=barbarians\r\nbarb
36=no barbarians\r\nno barb\r\nbarbarians no\r\nbarb no
37=archers\r\narch
38=no archers\r\nno arch\r\narchers no\r\narch no
39=giants\r\ngiant\r\nany\r\nreinforcement
40=no giants\r\ngiants no
41=goblins\r\ngoblin
42=no goblins\r\ngoblins no
43=wall breakers\r\nbreaker
44=no wall breakers\r\nwall breakers no
45=balloons\r\nballoon
46=no balloon\r\nballoons no
47=wizards\r\nwizard\r\nwiz
48=no wizards\r\nwizards no\r\nno wizard\r\nwizard no
49=healer
50=no healer\r\nhealer no
51=dragon
52=no dragon\r\ndragon no
53=PEKKA\r\npekka
54=no PEKKA\r\npekka no
95=baby dragon\r\nbaby
96=no baby dragon\r\nbaby dragon no\r\nno baby\r\nbaby no
97=miner|mine
98=no miner\r\nminer no\r\nno mine\r\nmine no
55=minions\r\nminion
56=no minions\r\nminions no\r\nno minion\r\nminion no
57=hogriders\r\nhogs\r\nhog
58=no hogs\r\nhog no
59=valkyries\r\nvalkyrie\r\nvalk
60=no valkyries\r\nvalkyries no\r\nno valk\r\nvalk no
61=golem
62=no golem\r\ngolem no
63=witches\r\nwitch
64=no witches\r\nwitch no
65=lavahound\r\nlava\r\nhound
66=no lavahound\r\nlava no\r\nhound no
93=bowler\r\nbowlers\r\nbowl
94=no bowler\r\nbowl no
87=poison
88=no poison\r\npoison no
89=earthquake\r\nquake
90=no earthquake\r\nquake no
91=haste
92=no haste\r\nhaste no
99=skeleton|skel
100=no skeleton\r\nskeleton no\r\nno skel
71=ground support\r\nground
72=1st
73=2nd
74=3rd
76=no ground\r\nground no\r\nonly
101=air support\r\nany air
102=no air\r\nair no\r\nonly\r\njust
78=General Blacklist
77=Do NOT donate to any of these keywords
79=clan war\r\nwar\r\ncw
80=General Blacklist for donation requests


[613]
1=Донат по расписанию
2=Donation Clan Mates Filter
8=Using this option you can choose to donate to all members of your team (No Filter), donate only to certain friends (White List) or give everyone except a few members of your team (Black List)
4=No Filter, donate at all Clan Mates
5=No Filter but collect Clan Mates Images
6=Donate only at Clan Mates in White List
7=Donate at all Except at Clan Mates in Black List
10=Images of Clan Mates are captured ad stored in main folder, move to appropriate folder (White or Black List)
9=Open Clan Mates Image Folder

[616]
27=Включить обновление
28=после использования кнопки "Указать здание"
29=тип улучшения , нажмите чтобы увидеть местоположение
30=Статус : Красный = не запрограммирован ,Желтый = запрограммирован , не завершен, Зеленый = завершен
31=Название здания  
32=Лвл здания
33=Стоимость апгрейда 
34=Время апргрейда
35=Включить повтор улучшения?
1=Здания или герои
2=Название
3=№
4=Тип
5=Цена
6=Время
7=Повтор
8=Указать здание
9=кнопку для обнаружения и записи информации о создании обновлений /Нажмите
10=Не улучшения повторно
11=Отмена улучшения
12=Кнопка отмены и удаление информации об улучшениях
13=Если повтор включен, то данные не сбрасываются
14=Золото
15=Оставлять золота в хранилищах после улучшения
16=Оставлять для поиска или обновления стен
17=Эликсир
18=Оставлять эликсира в хранилищах после улучшения
19=Оставлять для тренировки войск или улучшения стен
20=Ч.эликсир
21=Оставлять в хранилище черного эликсира после улучшения
22=Увеличьте значение для тренировки армии
36=Это поле обновляется в соответствии окончания обновления, после обновления проверяется
37=Конец

[614]
1=Лабратория
2=Апгрейд войск/заклинаний
3=Отметьте флажок, чтобы разрешить автоматический запуск обновления в лаборатории
4=След.
5=Выберите тип войск чтобы обновить с помощью этого выпадающего меню
6=Значек появится значок слева
7=Любое темное заклинание/войска имеют приоритет над апгрейдов героев!
8=красный означает, что в лаборатории едет улучшение
9=это автоматически исчезнет, когда время улучшения будет заканчиваться
10=если улучшение завершено в ручную, за кристаллы
11=Нажмите красную кнопку, чтобы сбросить таймер. ПОСЛЕ ЭТОГО ЗАПУСТИТЕ НОВОЕ УЛУЧШЕНИЕ
12=Предупреждение - ненужное улучшение заставит постоянно проверять статус лаборатории
19=Troop Upgrade started
20=Will begin to check completion at:

[615]
1=Постоянное улучшение героев
2=Авто улучшение героев
3=Включить улучшение короля, когда у вас будет достаточно ч.эликсира (с сохранением мининимального количества ч.эликсира в хранилище)
4=Можно вручную найти алтарь короля на вкладке Разное
5=Проверьте значение ч.эликсир на вкладке Разное("начать атаку", при минимальном количестве ресурсов в хранилищах!)
11=доступно с 7 ратуши
6=Включить улучшение королевы, когда у вас будет достаточно ч.эликсира (с сохранением мининимального количества ч.эликсира в хранилище)
7=Можно вручную найти алтарь королевы на вкладке Разное
12=Доступно с  9 ратуши
8=Включить улучшение колдуна, когда у вас будет достаточно ч.эликсира (с сохранением мининимального количества ч.эликсира в хранилище)
9=Можно вручную найти алтарь колдуна на вкладке Разное
13=доступно для 11 ратуши

[617]
1=Стены
2=Включить апгрейд
3=Убедитесь, что справа выставлено минимальное значение золота и эликсира, которое останется для поиска,тренировки войск или другого улучшения.
4=Выставите любое значение от 1 до 8, для теста и улучшения стен. Выше - лучше, но медленнее.
5=ТЕСТ
6=Нажмите, чтобы проверить обнаружение стен.
7=За зотоло
8=Улучшать только за золото.
9=Доступно на всех уровнях стен.
10=За эликсир
11=Улучшать только за эликсир.
12=Улучшение за эликсир доступно начиная с 9 ратуши.
13=За эликсир и золото
14=Улучшает сперва за эликсир, потом за золото
15=Сохранять строителя для стен
16=Если стоит галочка, то один строитель всегда свободен, и улучшает только стены.
17=Если снята галочка,то стены будут улучшаться, когда один из строителей освободится.
18=Уровень стен
19=Выберите уровень стены от 4 до 10, который вы желаете улучшить.
20=Затраты на 1 стену
21=Эта сумма будет потрачена для улучшения стены.
22=Это значение обновится после выбора другого уровня стены.
23=Мин.золота
24=Сохранять, хотя бы это количество золота в хранилищах после улучшения.
25=Оставлять для поиска или других улучшений.
32=Мин.эликсира
27=Сохранять, хотя бы это количество эликсира в хранилищах после улучшения.
28=Оставлять для тренировки армии или других улучшений.
29=Счётчик стен
30=Введите количество стен, которое у вас есть. Для каждого уровня своё значение. Уровень:
31=

[619]
2=Настройки
3=Включить
4=Включить оповещение
5=Удаленное упр.
6=Включение функций удаленного управления
7=Удал.сооб.при запуске
8=Сообщения будут удаляться при запуске бота
9=Удалить все
10=Нажмите, чтобы удалить все сообщения PushBullet.
11=Удал.сообщ.старше
12=Удалять сообщения, которые старше выбранного времени
13=Интервал очищения истории сообщений.
14=Токен аккуанта
15=Для работы оповещения требуется токен, который можно получить на PushBullet.com. Требуется регистрация.
16=Название профиля
17=Укажите профиль, который в данный момент используется.
18=О каких событиях вы хотите знать?
19=База найдена
20=Сообщение о найденой для атаки базе
21=Скриншот атаки
22=Отправит скриншот атаки
23=Атака
24=Отправит текстовое сообщение о последней атаке.
25=Лагерь
26=Отправит текстовое сообщение, о том что лагерь полный
27=Улуч. стен
28=Сообщит о улучшенной стене
29=Ошибка синхр.
30=Сообщит о том, что клиент и сервер не синхронизированы
31=Отдых жителей
32=Сообщит о длительном нахождении в онлайне, и что жителям пора отдохнуть.
33=Статистика
34=Отправит статистику атак, фарма и т.д.
35=Последняя атака
36=Проинформирует о последней атаке.
37=Другое устойство
38=Сообщит о том, что ваша деревня загружена с другого устройства.

[620]
0=Команды удаленного управления (Пример: BOT имя профиля HELP)
1=BOT
14=HELP
2=     - отправить эту справку
15=<>DELETE
3=     - удалить все предыдущие сообщения
16=RESTART
4=     - перезапустить бот и эмулятор
17=STOP
5=     - остановить бот
18=PAUSE
6=     - пауза
19=RESUME
7=     - снять с паузы
20=STATS
8=     - отправить статистику
21=LOG
9=     - прислать лог.txt
22=LASTRAID
10=    - отправить скриншот атаки
23=LASTRAIDTXT
11=    - отправить тестовое сообщение об атаке
24=CREENSHOT
12=    - отправить скриншот деревни

[610]
1=Остановить атаку
2=Используйте эту опцию для прекращения атак
3=Стоп атака
4=Стоп бот
5=Закрыть бота
6=Закрыть CoC+бот
7=Выключить ПК
8=Сон ПК
9=Перезагруз. ПК
10=когда...
11=З и Э Full и Макс.Трофеев
12=(З и Э) Full или Макс.Трофеев
13=(З или Э) Full и Макс.Трофеев
14=З или Э Full или Макс.Трофеев
15=Золото и Эликсир Full
16=Золото или Эликсир Full
17=Золото Full и Макс.Трофеев
18=Эликсир Full и Макс.Трофеев
19=Золото Full Или Макс.Трофеев
20=Эликсир Full или Макс.Трофеев
21=Золото Full
22=Эликсир Full
23=Кубки Full
24=Ч.эликсир Full
25=Всё (G+E+DE) Full
26=Бот выключится через...
27=Тренировка и донат
28=Только донат
29=Поддерживать онлайн
30=Щит(Тренировка/Донат)
31=Щит(Донат)
32=Щит(Когда в сети)
35=Бот остановится автоматически, когда хранилища будут пусты. Работа будет возобновлена при минимальных значениях.
36=Возобновить
37=Минимальное значение золота для бота, чтобы возобновить атаку после остановки из-за низкого количества золота.
38=Минимальное значение эликсира для бота, чтобы возобновить атаку после остановки из-за низкого количества золота.
39=Минимальное значение ч.эликсира для бота, чтобы возобновить атаку после остановки из-за низкого количества золота.
40=Перезарядка, уборка, сбор
41=Автоперезарядка ловушек, плазм, арбалетов
42=Установите этот флажок, чтобы автоматически перезаряжать ловушки, арбалеты и плазмы (если таковые имеются в вашей деревне)
43=Сбор ресурсов
44=Установите этот флажок, чтобы автоматически собирать ресурсы с коллекторов, шахт, дрелей и повозки.
45=
46=
47=Уборка надгробий
48=Установите этот флажок, чтобы автоматически убирать надгробия после нападения противника.
49=Препятствия
50=Установите флажок, чтобы бот автоматически очищал деревню от деревьев, стволов и т.д..
51=Удалять гем бокс
52=Установите этот флажок, чтобы бот автоматически удалял ящик с кристалами.
53=Найти здания в ручную
54=Ратушу
55=Установить
56=Клановый замок
57=В.Л.
58=Военный лагерь
59=Каз.
60=Казарму
61=Ф.З.
62=Фабрику заклинаний
63=Т.Ф.З.
64=Тёмную фабрику заклинаний
65=Король
66=Короля
67=Королева
68=Королеву
69=Колдун
70=Колдуна
71=Лаб.
72=Лабораторию
73=Сброс
74=Нажмите здесь для сброса всех расположений зданий,
75=если вы перестроите деревню.

[618]
1=Оборона деревни
2=Включить нерушимость
3=Включить нерушимый режим для получения наград от обороны.
4=Ожидание
5=Выставите время, на сколько остановится COC для ожидания вражеской атаки, чтобы получить выигрыш от обороны.(1-99 минут)
6=Минуты
7=Нормальный
8=Нерушимый
9=Количество золота, при котором отключается режим обороны деревни, и переключается в нормальный режим.
10=Установите мин. количество золота, которое требуется для поиска или улучшения.
11=Количество золота в хранилищах, необходимое для обеспечения обороны деревни.
12=Введите кол-во золота, чтобы привлечь противника или для улучшения.
13=Количество эликсира, при котором отключается режим обороны деревни, и переключается в нормальный режим.
14=Установите мин. количество эликсира, которое требуется для тренировки войск или улучшения.
15=Количество эликсира в хранилищах, необходимое для обеспечения обороны деревни.
16=Введите кол-во эликсира, чтобы привлечь противника или для улучшения.
17=Количество ч.эликсира, при котором отключается режим обороны деревни, и переключается в нормальный режим.
18=Установите мин. количество ч.эликсира, которое требуется для тренировки войск или улучшения.
19=Количество ч.эликсира в хранилищах, необходимое для обеспечения обороны деревни.
20=Введите кол-во ч.эликсира, чтобы привлечь противника или для улучшения.
21=Как использовать нерушимый режим:
22=Нерушимый режим поможет вам получить награды и достижение «Нерушимый».
23=Установите время обороны.
24=Нормальный (режим) - бот нападёт, когда кол-во ресурсов будет соответствовать настройке.
25=Нерушимый (режим)- бот включит нерушимый режим, когда кол-во ресурсов будет соответствовать настройке.
26=Нажмите на ссылку для получения дополнительной информации:
27=Доп.информация

[623]
1=ускорить на
2=Ускорение казарм
3=Кол-во казарм
4=Сколько казарм нужно ускорить при помощи кристаллов? Используйте с осторожностью!
5=Казармы
6=На сколько часов ускорить ваши казармы с помощью кристаллов? Используйте с осторожностью!
7=Ускорение фабрик заклинаний
8=Заклинания
9=На сколько часов ускорить вашу фабрику заклинаний с помощью кристаллов? Используйте с осторожностью!
10=Тёмные заклинания
11=На сколько часов ускорить вашу тёмную фабрику заклинаний с помощью кристаллов? Используйте с осторожностью!
12=Ускорение восстановления героев
13=Короля
14=На сколько часов ускорить восстановление вашего короля с помощью кристаллов? Используйте с осторожностью!
15=Королеву
16=На сколько часов ускорить восстановление вашей королевы с помощью кристаллов? Используйте с осторожностью!
17=Колдуна
18=На сколько часов ускорить восстановление вашего колдуна с помощью кристаллов? Используйте с осторожностью!
19=Планировщик ускорения казарм

[621]
26=Установить количество
27= в шт.
28=
29=
1=Войска
2=Установите тип армии.
3='Использовать казармы' или 'Пользовательские войска' для ручной настройки.
4=Лучницы
5=Варвары
6=Гоблины
7=Вар.Луки
8=Bарв.Лук.Гиг.Гобл
9=Bарв.Лук.Гиг
10=Bарв.Лук.Гобл
11=BарвЛукГигГоблСтенобои
12=Использовать казармы
13=Свои войска
14=Войска
15=Всего
16=Общий % войск должен быть равен 100%.
17=Казармы
18=Установите войска в казарму
19=Численность армии
20=Лагеря
21=Бот начнет атаковать, если процент заполнения казарм равен или выше этого значения в %.
22=Свои войска
23=Тёмные войска
24=Тёмные войска
25=Войска тёмной казармы
30=Опции казармы
31=Не пустые казармы
32=Бот не будет удалять воинов из казармы, при обучении.

[622]
1=Заклинания
2=Ёмкость.Заклинаний
3=Установите количество заклинаний, которое Вы будете использовать. Установите '0' если не хотите использовать заклинания в бою.


[608]
1=Развёртывание войск
2=Последовательность высадки
3=Атака
4=Нападение на одну сторону, проникает через базу
5=Атака с двух сторон, проникает через базу
6=Атака с трех сторон, разрушает наружные и некоторые внутренние здания
7=Выберите сторону(ы) нападения
8=с одной стороны
9=с двух сторон
10=с трёх сторон
11=со всех сторон
12=Задержка
13=Задержка развертывания войск, 1 (Быстро) = Как бот, 10 (Медленно) = Как человек
14=Случайная скорость сделает бот разнообразнее и ближе к человеку.
15=волн
16=Случайная скорость задержки
17=Смарт атака
18=Используйте смарт атаку, чтобы обнаружить 'красную линию'. И развертывание войск будет происходить по красной линии.
19=Высадка
20=Выберите режим для развертывания волны войск.
21=Тип 1: Высадка по одной волне войск с каждой стороны, затем переключатель войска
22=Тип 2: Высадка всех войск (например: гиганты, варвары и лучники) на каждой стороне, затем перейти на другую сторону.
23=Стороны, затем войска
24=Войска, затем по сторонам
26=Высадка войск возле шахт
27=Высадка войск возле коллекторов
28=Высадка войск возле дрелей
29=Атаки с одной стороны ближе к хранилищу ч.эликсира
30=Атаки с одной стороны ближе к ратуше
31=со стороны Ч.Э.
32=со стороны ТХ 
25=По умолчанию (все войска)
33=Выберите порядок высадки войск.
34=Вариант развертывает войска в различном порядке и разные волны
35=Только выбранные в опции "Высадка этих войск" войска будут сброшены

[607]
1=Высадка
2=IMG
3=Сделать IMG с дополнительной информацией в профиль -> Папка Temp
4=Выберите скрипт; Вы можете редактировать / добавлять новые скрипты, расположенные в папке: "CSV / Атака"
5=Обновить скрипты
6=Показать / Редактировать текущий скрипт атаки
7=Создать новый Сценарий Атаки
8=Скопировать текущий сценарий атаки с новым именем

[631]
79=Откл.
80=Выберите Milking тип поиска
59=Медл.: проверяет наличие ресур.в коллек.
60=Быстрый: проверяет уровень коллекторов
2=Мин. уровень коллекторов для начала атаки
3=Уровень 1-4
4=Уровень 5
5=Уровень 6
6=Уровень 7
7=Уровень 8
8=Уровень 9
9=Уровень 10
10=Уровень 11
11=Уровень 12
31=Легенда
32=0-4%
33=5-19%
34=20-74%
35=75-89%
36=90-100%
56=На что нападать?
13=на это
14=Уровень
16=Атаковать, если
17=расстоян.между кр.линией и коллек.
18=золота в хран. меньше
19=эликсира в хран. меньше
20=ч.эликсира в хран. меньше
21=4. атака на каждый сборщик ресурсов
22=- Воинов в волне:
23=- Макс. кол-во волн:
85=выбирете максимальное количество волн, воинов при нападение на каждый коллектор.
86=если коллектор разрушен, то на него больше не будут нападать.
24=- Задержка(ms):
71=5. Высадка войск
72=Высаживать гоблинов в одном месте
73=Высаживать гоблинов беспорядочно
74=Атака: как настроено
75=Атака: случайная
76=Атака: сбоку
61=Проверка разрушений
62=Проверка разрушений до след. волны
63=Перед тем как атаковать коллектор.шахту, проверить, был ли он уничтожен пред. волной.
64=У вас должна стоять большая задержка между волнами, чтобы использовать эту опцию
65=Проверка разрушений после волны
66=После нападения на обьект, проверить был ли он уничтожен предыдущей волной.
67=У вас должна стоять большая задержка между волнами, чтобы использовать эту опцию
25=5а. Снайп атака на ТХ снаружи, после Milking
82=Включить Снайп ТХ
27=Количество клеток от границы
28=Стиль атаки
29=Снайп атака, даже если сборщики пустые
84=5б. Скрипт Атака
83=Включить Скрипт Атаку
30=Использовать Скрипт Атаку для метвых баз(выключает стандартную атаку)
68=Настройки погрешности
50=Вкл.
51=Нормальная
52=Высокая
53=Очень высокая
37=Отладка
38=Сделать изображение каждого коллектора со смещением
41=Сделать изображение деревни
39=полный поиск, только для отладки (очень медленно)
81=с этой опцией вы можете обнаружить изображения с незамеченными коллекторами

[625]
0=Параметры
1=Поиск
2=Рандомное возвращение домой.Кол-во поисков ОТ 
3=ДО
4=Трофеи
5=Поиск деревни по кол-ву трофеев в диапазоне ОТ
6=ДО
7=Лагеря
8=Бот начинает атаку, если процент заполнения казарм равен или выше этого значения в %.
9=Ждать героев
50=Ожидание героя, отключено при непрерывном улучшении!
10=Ожидание короля ...
51=Доступно: 7тх и выше
12=Ожидание королевы...
52=Доступно: 9тх и выше
13=Ожидание колдуна...
53=Доступно: 11тх
14=Критерии поиска
15=Поиск базы по количеству золота и / или / или эликсир.
16=И: Оба условия должны соответствовать параметрам поиска, золота и эликсира.
17=ИЛИ: Одно условие должно соответствовать параметрам поиска, золота или эликсира.
18=+ (сумма): Общий объем Золото + Эликсир
19=З и Э
20=З или Э
21=З + Э
22=З и Э
23=Установите мин. количество золота для атаки.
24=Установите мин. количество элисира для атаки.
25=Установите мин. количество золото + элисир для атаки.
26=Ч.эликсир
27=Поиск базы по мин. значениям ч.эликсира
28=Установите мин. количество чёрного эликсира для атаки.
29=Поиск базы по мин. количеству трофеев.
30=Поиск базы будет осуществляться по количеству трофеев.(минимальное кол-во)
31=Ратуша
32=Выбирите максимальный уровень ратуши.
33=Установите мин. уровень ТХ  для атаки.
34=Ратуша снаружи
35=Поиск базы будет осуществляться по ратуше, которая находится за пределами стен.
36=Слабые базы
37=Поиск базы со слабой обороной.
38=Установите Макс. уровень мортиры
39=Установите Макс. уровень башни колдуна
40=Одно из условий для атаки
41=Атаковать, если при поиске совпадёт одно из условий.
42=Расстояние от края
43=до ратуши
44=-<100%
45=количество плиток от края деревни до ратуши(атака во время тренировки)
46=-армия 100%
47=Установите расстояние от края до ТХ (в клетках), чтобы считать, что она снаружи.
48=Пример: (0) плиток; ТХ должен быть ровно по краю. (4) плитки: ТХ должен быть удалён на 4 плитки от края, ближе к центру базы.
68=Примечание - Диапазон поиска только для данного типа атаки.
69=Настройки не будут устанавливать ограничения поиска, чтобы перезапустить процесс поиска!
70=Эта опция не будет корректировать трофеи, чтобы остаться в диапазоне!
65=Включить для 7 Ратуши или выше
66=Включить для 9 Ратуши или выше
67=Включить для 11 Ратуши 
100=Не Атаковать если заклинания не готовы
101=Внимание: не включайте с функцией (режим заклинаний)!
54=Мортира
59=Искать базу у которой уровень ниже заданого.
55=Башня мага
60=Искать базу у которой уровень ниже заданого
56=Арбалет
61=Искать базу у которой уровень ниже заданого
57=Ад.Башня
62=Искать базу у которой уровень ниже заданого
58=О.Артилерия
63=Искать базу у которой уровень ниже заданого
49=Если TH находится дальше, чем количество плиток, база будет пропущена.
99=Ждать Заклинания
100=Стоп атака,заклинания не готовы!



[624]
1=Атака с
2=Тип атаки
3=Обычная атака
4=Атака CSV
5=Milking атака
6=Только падение этих войск
7=Все войска
8=Казармы
9=Варвары
10=Луцницы
11=Варвары+Луки
12=Варвары+Гобл
13=Луки+Гобл
14=Вар+Луки+Гиги
15=Вар+Луки+Гобл+Гиги
16=Вар+Луки+Хоги
17=Вар+Луки+Миньоны
18=Выберите войска для атаки
19=Герои
20=Использовать короля
41=от 7 тх
21=Использовать королеву
42=от 9 тх
22=Использовать колдуна
43=11 тх
23=Высаживать клан.
24=использовать молнию 
25=Использовать целение
26=Использовать ярость
27=Использовать прыжок
28=Использовать заморозку
29=Использовать яд
30=Использовать землетрясение
31=Использовать ускорение
32=ТХ Снайп
33=Снайп ТХ
34=Если ратуша находится снаружи, то сперва Снайп атака
35=+ клетки
36=Расстояние от края до ТХ (в клетках), чтобы считать, что она снаружи.
37=Вы можете добавлять/редактировать параметры CSV в папке CSV\THSnipe
38=Ратуша снаружи
39=Проверьте это , чтобы атаковать открытую Ратушу в первую очередь. (Ратуша вне стен)
40=Подсказка: Также поставьте галочку «Ратуша снаружи» на вкладке Поиск, если вы только хотите искать базы с ратушой снаружи.

[606]
1=Конец Боя
2=Если лута не обнаружено
3=Заканчивать битву, если лута не обнаружено
4=Отсчёт времени начитается после высадки всех войск.
5=через
7=и ресурсов меньше
8=Конец боя, если осталось меньше этого кол-ва золота.
9=Когда нет ресурсов
10=Битва закончится, когда кол-во ресурсов в хранилищах будет = 0
11=Одна звезда
12=Битва закончится, когда будет получена одна звезда
13=Две звезды
14=Битва закончится, когда будет получена две звезды
15=Темный эликсир и конец боя
16=Атака со стороны с Ч.эликсира и конец боя.
17=Включена атака со стороны хран. ч.эликсира для Живые Базы. Парамерты:
18=Когда ниже
19=Обеспечивает специальные условия для атаки со стороны хран. ч.эликсира.
20=Если не включены. доп. фильтры, то битва закончится, когда кол-во ч.эликсира будет меньше выставленного значения в %.
21=Отключить обычный конец боя
22=Отключает нормальный конец боя, если используется конец боя по ч.эликсиру
23=Бой закончится, когда ч.элксира нет и получена одна звезда.
24=когда
25=Бой закончится, когда нет ч.элксира и король почти уничтожен.
26=при смерти
27=Бой закончится, когда нет ч.элксира и королева почти уничтожена.
28=Переключить DB Атаку в конец
29=Установите% лагерей армии, прежде чем активировать эту опцию

[626]
15=Если этот флажок установлен, то бот будет искать
30=заполненны
1=Уровень коллекторов
2=для поиска мертвой базы
16=коллектора 6 уровня
3=6 уров. на
23=заполненность коллекторов 6-го ур.
10=(N/A)
17=коллектора 7 уровня
4=7 уров. на
24=заполненность коллекторов 7-го ур.
18=коллектора 8 уровня
5=8 уров. на
25=заполненность коллекторов 8-го ур.
19=коллектора 9 уровня
6=9 уров. на
26=заполненность коллекторов 9-го ур.
20=коллектора 10 уровня
7=10 уров. на
27=заполненность коллекторов 10-го ур.
21=коллектора 11 ур.
8=11 уров. на
28=заполненность коллекторов 11-го ур.
22=коллектора 12 ур.
9=12 уров. на
29=заполненность коллекторов 12-го ур.
11=Погрешность
12=Используйте этот ползунок для регулировки погрешности всех изображений.
13=Если вы хотите настроить свои изображения, необходимо отредактировать файлы.
31=Предупреждение: Не изменяйте этот параметр, если вы знаете, что вы делаете. Установите его в 0, если вы не уверены в своих действиях.
32=Disable Collector Filter
33=Excluding Collector Filter the bot consider DeadBase as LiveBase

[630]
1=Настройки понижения
2=Снижение значений поиска
3=Отметьте этот флажок, если вы хотите, чтобы значения автоматически снижались после определенного количества поисков.
4=Уменьшать каждые
5=Введите кол-во поисков, перед уменьшением значений.
6=- уменьш. золота на
7=Уменьшее значения золота после опред. кол-ва поисков.
8=- уменьш. эликсир на
9=Уменьшее значения эликсира после опред. кол-ва поисков.
10=- уменьш. З+Э на
11=Уменьшее значений золото+эликсир после опред. кол-ва поисков.
12=- уменьш. ч.эликсир на
13=Уменьшее значения ч.эликсира после опред. кол-ва поисков.
14=- уменьш. трофеи на
15=Уменьшее значения трофеев после опред. кол-ва поисков.
16=Параметры поиска
17=Атаковать сейчас!
18=Появится кнопка Атаковать сейчас! рядом с
25=кнопками Старт и Стоп.
26=Атаковать сейчас!Эта кнопка отображается только при поиске деревень для атаки.
19=доб.
20=Добавите время, чтобы увеличить задержку при поиске, для того чтобы успеть нажать кнопку.
21=Возвращение домой каждые
22=Возвращение на базу после Х поисков и перезапуск поиска противника.
23=Звуковое оповещение Атаки
24=Звуковой сигнал и всплывающее сообщение, когда деревня найдена.

[634]
1=Активация способностей героев
2=Автомат (кр.линия)
3=Активирует способность, когда герой становится слабым.
4=Проверка состояния здоровья и активация индивидуально.
5=Через
6=Активирует способность после остановки таймера.
7=Все герои активируются одновременно.
8=Установите время в секундах для активации способности героя.
9=Актирировать Колдуна через
10=Активирует способность Колдуна через..
11=Установите время в секундах, для активации возможности Колдуна.
12=Клановый Замок
13=Баланс D/R
14=Высаживать из клана только, если доната больше, чем получено.
15=Коеффициент доната
16=пожервовано / получено 
17=1/1 означает получил, 1/2 означает, что получил половину и т.д.
18=Коэфициент получ.
20=Планировщик Атак
21=Включить Планировщик 
22=Эта опция позволит вам планировать время атаки
23=Бот продолжает работать и будет атаковать только тогда, когда график позволяет.
24=Закрыть Игру
25=Эта опция закроет Игру, когда не запланировано Поиск и Атака!
26=Бот продолжает работать и будет перезапущен, когда график позволяет.
27=Закрыть Эмулятор
28=Эта опция будет закрыть эмулятор, если не планируется Поиск и Атака!
29=Рандомное.Выкл
30=Эта опция будет рандомно атаковать
31=Выберите количество часов, чтобы прекратить нападения
35=Лимит Атак
36=Будет ли случайным образом прекращают атаковать, когда превышает случайное число атак между выбраным диапазоном
37=Введите минимальное количество атак в день
39=до
38=Введите максимальное количество атак в день
40=Включить CC Drop 
41=Используйте график, чтобы определить, когда снижается\r\n CC когда график не включен.

[633]
1=Повтор боя
2=Поделиться повтором в чате
3=Установите этот флажок, чтобы поделиться своим повтором битвы в чате.
4=Когда получено
5=Поделиться повтором ТОЛЬКО, когда золота больше чем это значение.
6=Поделиться повтором ТОЛЬКО, когда эликсира больше чем это значение.
7=Поделиться повтором ТОЛЬКО, когда ч.эликсира больше чем это значение.
8=Случайное сообщение из этого списка
9=Хорошо\r\nОтлично\r\nСпасибо \r\nУхтыы
10=Отправлять повтор атаки с таким текстом
11=Делать скриншот лута
12=Включите, чтобы делать скриншоты ваших атак.
13=Сведения о луте в имени файла
14=Сведения о луте в имени скриншота

[609]
1=Настройки трофеев
2=Диапазон
3=Минимальное значение, до которого бот будет скидывать кубки.
4=Максимальное значение, после превышения которого бот будет скидывать кубки.
5=Использовать героев
6=Использовать героев для сброса кубков.
7=Мёртвые базы
8=Атаковать только Мёртвые во время сброса трофеев.
9=Минимум войск
10=Введите процент армии, необходимый для начала скидывания трофеев.

[629]
1="Хулиган" комбо атака
2=В режиме Хулиган будут атакованы все базы, удовлетворяющие уровню Тх.
3=Включить после
4=ТХ Хулиган: кол-во поисков перед включением.
6=Макс.ур. Тх
7=ТХ Хулиган: Макс. уровень Ратуши для атаки.
8=Атаковать с настройками
9=Мёртвые
10=Используются параметры атаки для мертвых баз при атаке Тх хулиган.
11=Живые
12=Используются параметры атаки для живых баз при атаке Тх хулиган.

[627]
1=Загрузить Настройки.\n\n- Тренировки армии\n- Поиска и Атаки\n\n- Кроме вкладки Эксперт
2=Загрузить
3=Удалить
4=Открыть папку

[628]
1=Имя файла
2=Примечание
3=Сохранить Настройки\n--------------------------------------\n Сохранить Настройки:\n- Тренировки армии\n- Поиска и Атаки\nКроме вкладки Эксперт\n--------------------------------------
4=Сохранить

[636]
2=Когда бот загружен
3=Проверять обновления
4=Проверять используете ли вы последнюю версию бота
5=Удалять лог
6=Удалять лог файлы старше
7=дн.
8=Удал.вр.файлы
9=Удалять временные файлы старше
10=Удал. скрины лута
11=Удалять скрины лута старше
12=Когда бот запущен
13=Авто старт через
58=Автоматический старт через n секунд
15=Проверка языка COC (EN)
16=Проверять какой язык используется в игре (правильно английский).
17=АвтоВыравн.
18=Расположение бота отновительно окна эмулятора
20=Смещение по горизонтали
21=Смещение по вертикали
22=0,0: Android Эмулятор-Bot
23=0,0: Bot-Android Эмулятор
24=SNAP: Bot ВверхВправо to Android
25=SNAP: Bot ВверхВлево to Android
26=SNAP: Bot ВнизВправо to Android
27=SNAP: Bot ВнизВлево to Android
28=0,0: переместить окно Android эмулятор в положение 0,0 на рабочем столе и выровнить окно бота справа или слева от него.
29=SNAP: только упорядочить окна, выровнять бот справа вверху, вверху слева, внизу справа или внизу слева.
75=Задержка при поиске
76=используйте этот ползунок, чтобы изменить задержку между кликами на кнопку "Далее" (при поиске деревни для атаки).
77=это может уменьшить кол-во ошибок синхронизации на некоторых ПК.
78=НИКАКИХ ГАРАНТИЙ! Не всегда будет положительный результат!
81=включить случайную задержку
82=нижний ползунок максимального значения - дальше, чем верхний ползунок минимального значения
83=Язык бота
84= для смены языка нажмите на стрелочку
55=Настройки скринов
56=Сохранять в PNG формат
57=Скрывать имя деревни и клана
30=Скорость
31=Трен.войск
32=задержка
33=Увеличить время задержки, если ваш ПК слабый (медленно работает)
85=Удаленное устройство
86=Ждать др.устройство
87=введите время ожидания (в секундах) бота, пока Clash of clans будет запущен на другом устройстве.
45=другое
61=Вых. перед перерывом
62=это принуждает бота выйти из COC только один раз до перерыва
63=введите количество минут, чтобы держать сос закрытым. Значение 15=минимальное для сброса таймера личного перерыва
64=Мин
65=Вычит.пред.перерыв
66=введите количество минут, чтобы СОС закрывался раньше! Параметр ниже 10 минут может не работать!
46=Военный лагерь
47=если не правильно определил количество мест в лагерях
34=Отладка
40=Нажатия
35=Отладка: в лог отображаюся координаты нажатий (x,y)
41=Сообщения
36=Отладка: включает отладочные сообщения лога в код для устранения неполадок.
42=OCR
37=Отладка: позволяет сохранять распознавания образов для устранения неполадок.
43=Изображения
38=Отладка: позволяет сохранять изображения для устранения неполадок.
44=Здания
39=Отладка: показывает координаты зданий в логе
73=Тренировка
74=Отладка: показывает нажатия во время тренировки
88=Тест тренировки
89=Тест доната
90=Тест атаки
71=перезапуск бота с новым языком:
91=Отлаживать пожертвования
92=Отладка: не делать пожертвований OCR и моделировать только пожертвования, но не жертвовать любой отряд
100=Отключение Заставки
101=Отключить заставку при запуске.
95=Окно: Эмулятора Android и Бота
96=Обновление при сворачивании
97=Включить другую процедуру для минимизации окна бота
98=Скрыть при сворачивании
99=Скрыть окно бота в панели задач при сворачивании
94=Рандомный клик
80=Макс
19=
93=Опции
102=Test Click Drag (scrolling)
103=Test Image
104=Force Clan Castle Detection
105=If clan Castle it is undetected and it is NOT placed in the last slot, force bot to consider the undetected slot as Clan Castle

[Language]
DisplayName=Русский

[637]
1=Управление профилем
2=Нажмите, чтобы переключить профиль
3=Ваш профиль можно найти
4=Моя Деревня
5=Название вашей деревни/профиля
6=Добавить новый профиль
7=Подтвердить
8=Удалить профиль
9=Отмена
10=Переименовать

[632]
31=Сброс
2=До запуска:
0=Ур.TH:
3=отчёт
4=здесь
5=появится
6=после запуска
7=Количество золота у вас, когда бот начал
8=количество эликсира у вас, когда бот начал.
9=количество ч.эликсира у вас, когда бот начал.
10=количество кубков у вас, когда бот начал.
20=Прибыль
99=обновляется
97=после
98=каждой атаки.
21=общее количество золота, которое Вы приобрели или потеряли в то время как бот работает.
22=+ расходы на обновление
23=общее количество эликсира, которое Вы приобрели или потеряли в то время как бот работает.
24=общее количество ч.эликсира, которое Вы приобрели или потеряли в то время как бот работает.
25=общее количество кубков, которое Вы приобрели или потеряли в то время как бот работает.
26=Лут в час
27=золото/ч
28=эликсира/ч
29=ч.эликсир/ч
30=кубки/ч
102=Последняя атака
11=Прибыль
12=количество золота, которое вы получили за последнюю атаку.
13=количество эликсира, которое вы получили за последнюю атаку.
14=количество ч.эликсира, которое вы получили за последнюю атаку.
15=количество кубков, которое вы получили или потеряли за последнюю атаку.
16=Бонус лиги
17=Бонус золота, который вы получили за последнюю атаку.
18=Бонус эликсира, который вы получили за последнюю атаку.
19=Бонус ч.эликсира, который вы получили за последнюю атаку.
32=Статистика: Смешанная
105=Запуск:
47=Время работы
48=Общее время работы бота
57=Ошибки
58=Количество ошибок синхронизации
33=Атака
34=Количество деревень, которые атаковал бот
35=Пропущено
36=Количество деревень, которые пропустил бот
45=Скинул
46=Количество кубков, которое скинул бот (настройка на вкладке "Разное").
103=Улучшения
37=за золото
38=Кол-во стен улучшенных за золото
39=за эликсир
40=Кол-во стен улучшенных за эликсир
41=Потрачено золота на улучшение
42=Потрачено эликсира на улучшение
43=улуч. героев
44=Кол-во улучшенных героев
104=Затраты на улучшение
49=за золото
50=количество золота, которое было потрачено на улучшение стен
51=за эликсир
52=количество эликсира, которое было потрачено на улучшение стен
53=количество золота, которое было потрачено на улучшение зданий
54=количество эликсира, которое было потрачено на улучшение зданий
55=за ч.эликсир
56=количество ч.эликсира, которое было потрачено на улучшение героев
59=На поиск
60=Потрачено золота при поиске деревни
61=Трен.за элик
62=Потрачено эликсира при тренировке войск
63=Трен.за ч.э.
64=Потрачено ч.эликсира на тренировку темных войск
65=Соб.золота
66=Кол-во золота собранного с шахт
67=Соб.эликсира
68=Кол-во эликсира собранного с коллекторов
69=Соб.ч.эликсира
70=Кол-во ч.эликсира собранного с дрелей
71=Мертвые  базы
72=Атаковано
73=Кол-во атакованных мертвых баз.
74= 
75=Количество нафармленного золота с мертвых баз.
100=Количество нафармленного ч.эликсира с мертвых баз.
76=Количество нафармленного эликсира с мертвых баз.
78=Живые базы
79=Кол-во атакованных живых баз.
80=Количество нафармленного золота с живых баз.
81=Количество нафармленного эликсира с живых баз.
82=Количество нафармленного ч.эликсира с живых баз.
83=Количество кубков заработнных на живых базах.
90=TХ Снайп
101=Кол-во баз атаковано в режиме ТХ Снайп
91=Количество золота, полученного с помощью ТХ снайпа.
92=Количество эликсира, полученного с помощью ТХ снайпа.
93=Количество черного эликсира, полученного с помощью ТХ снайпа.
94=Количество трофеев, полученного с помощью ТХ снайпа.
95=Количество успешных атак ТХ снайпа
96=Количество неудачных атак ТХ снайпа
84=Тх Хулиган
85=Кол-во баз атаковано в режиме ТХ Хулиган
86=Количество золота, полученного от "ТХ Хулиган".
87=Количество эликсира, полученного от "ТХ Хулиган".
88=Количество черного эликсира, полученного от "ТХ Хулиган".
89=Количество золота, полученного от "ТХ Хулиган".
106=Лига

[635]
1=Создать Новый Файл скрипта
2=Новое Имя Скрипта
3=файл существует, введите новое имя
4=произошла ошибка при создании файла
5=Копировать новый скрипт
6=Копия
7=с новым именем скрипта

[90]
2=Смарт Зап
3=Использовать молнии 
4=Включить удары Молний по скважинам чёрного эликсира
5=Внимание!!! Во в вкладке "Войска" поставьте максимальное 
6=кол-во ваших заклинаний,
7=так бот будет функционировать идеально.
13=Только для Мёртвых баз
8=Рекомендуется только для Мёртвых баз
9=Дарк в живой базе будет находиться в хранилище.
10=Минимум количество дарка:
11=Значение здесь во многом зависит от лвл вашей Ратуши, 
12=и лвл скважин.
14=Не для ТХ Снайпс
16=Это остановит SmartZap во время атаки на базы ТХ Снайпс
17=если ваши герои атаковали. 
18=Это позволяет сохранить их здоровье, так что они будут готовы к бою раньше!
19=Количество выбитого дарка.
20=Количество используемых заклинаний.
21=Сохранить войска для коллекторов
22=Мульти атака
23=Выбор Мульти атаки, если меньше 
24=80% от коллекторов до красной линии .
25=Это позволит перейти к 0 задержки для быстрой атаки.
26=Мин. до красной линии:
27=Предложения: 
28=  Если Варв.\Луки 6 лвл и выше 70%.
29=  Если Варв.\Луки 5 лвл и выше 80%.
30=  Если Варв.\Луки 4 лвл и выше 90%.
31=Макс. расстояние до красной линии:
32=Максимальное количество пикселей между коллектором и красной линией.
33=Рекомендовано: 50 пикселей.
34=пикселей.
35=% Коллекторов.

[640]
32=Нажмите ДА, затем нажмите на Замок Клана
33=Найти Замок Клана
34=Нажмите ДА, затем нажмите на алтарь Королевы
35=Найти Королеву
40=Найти Короля
42=Найти Колдуна
39=Нажмите ДА, затем нажмите на алтарь Короля
41=Нажмите ДА, затем нажмите на алтарь Колдуна
43=Нажмите ДА, затем нажмите на Лабораторию
44=Найти Лабораторию
45=Нажмите ДА, затем нажмите на Фабрику Заклинаний
46=Найти Фабрику Заклинаний
47=Найти Тёмную Фабрику Заклинаний
48=Нажмите ДА, затем нажмите на Темную Фабрику Заклинаний
49=Нажмите ДА, затем нажмите на Ратушу
26=Не перемещайте мышь после нажатия на здание!
27=Убедитесь, что я обнаружил здание!
50=Найти ратушу
1=да|отмена
73=Казармы
74=Не освобождать казармы
75=Бот не будет удалять существующие войска из казарм после того, как закончит обучение армии.
76=Режим заклинаний
77=Бот будет постоянно варить заклинания (только для молнии, исцеления и ярости).
23=Казарму
24=Лагерь
25=Нажмите ДА, затем нажмите на
28=Найти
63=Нажмите кнопку OK, чтобы удалить и сбросить все данные о зданиях,
64=Примечание =>> Бот закроет игру,  необходимо перезапустить Бота после завершения
65=Или Нажмите кнопку Отмена, чтобы выйти 
66=Удалить и Выйти | Отмена
67=Удалить информацию о зданиях?
68=Вы на 100% уверены, что хотите удалить информации о зданиях?
69=жмите кнопку ОК, чтобы удалить, а затем перезапустить бота (вручную)
51=Нажмите кнопку "Найти" Здание затем нажмите на ваше Здание/Геровев для обновления.
52=Нажмите кнопку "Готово", когда закончите местонахождение все всех зданий.
53=Нажмите на кнопку Отмена, чтобы выйти и найти здания.
54=Найти здание| Выполнено | Отменено
55=Обнаружение Обновления
56=Держите мышь на окне Эмулятора пока я проверяю обновления, спасибо!!!!
36=OK
37=Уведомление
72=If you locating your TH because you upgraded,
78=Click OK to close bot and then restart the bot (manually)


[91]
1=Андроид
2=Андроид Опции
3=Используйте эту функцию, чтобы выбрать Андроид Эмулятор для использования с этим профилем.
4=Пример:
5=Введите пример для использования с этим профилем.
6=Скрыть значок
7=Используйте это чтобы скрыть окно эмулятора с панели задач, при нажатии кнопки скрыть
8=Внимание: Может вызвать неустойчивое поведение, снимите флажок, если у вас есть проблемы.
9=Настройки Батла
10=Включить Быстрые ADB Клики
11=Отметьте это для того, чтобы ускорить ADB развертывание  для MEMU и Droid4x в Малти-режиме.
12= ВНИМАНИЕ: Это экспериментальная функция, если у вас есть проблемы с развертыванием, отключите эту функцию.


[999]
1=Профили
2=Профиль:
3=Используйте это, чтобы переключиться на другой профиль.
4=Ваши профили / конфиги можно найти в:
5=Моя Деревня
6=Имя вашего деревни
7=Переключение профиля количество золота
8=Профиль
9=Этот параметр используется для переключения профилей, когда золото выше суммы.
10=Выберите, какой профиль должен быть включен, когда набрана нужная сумма
11=Когда золото выше
12=Установите количество золота, чтобы переключился профиль.
13=Этот параметр используется для переключения профилей, когда золото ниже суммы.
14=Когда золото ниже
15=Переключение профиля количество Эликсира
16=Этот параметр используется для переключения профилей, когда эликсир выше суммы.
17=Когда Эликсир выше
18=Установите количество Эликсира, чтобы переключился профиль.
19=Этот параметр используется для переключения профилей, когда эликсир ниже суммы.
20=Когда Эликсир Ниже
21=Переключение профиля количество Дарка 
22=Этот параметр используется для переключения профилей, когда Темный эликсир выше суммы.
23=Когда Дарк выше
24=Установите количество темной эликсир, чтобы вызвать переключение профиля.
25=Установите количество Чёрного Эликсира, чтобы переключился профиль.
26=Когда Дарк ниже
27=Переключатель профиля  количество Трофеев
28=Этот параметр используется для переключения профилей, когда Трофеи выше суммы.
29=Когда Трофеи выше 
30=Установите количество трофеев, чтобы переключился профиль.
31=Этот параметр используется для переключения профилей, когда Трофеи ниже суммы.
32=Когда Трофеи ниже

[100]
1=Рандом
2=Сон
3=Включить Слип Мод
4=Включите эту опцию, чтобы заставить бота выйти из игры в течение длительного периода, чтобы спать.
5=Рекомендации: Используйте эту настройку, по крайней мере 8 часов сна.    
6=Начало в: 
7=Выбирети час в который вы хотите чтобы бот начал спать.
8=Это время может быть примерно +/- 30 минут.
9=Рекомендации: Используйте эту настройку, по крайней мере 8 часов сна.    
10=Окончание в: 
11=Выберите час вы хотите, чтобы бот проснулся.
12=Это время может быть примерно +/- 30 минут.
13=Рекомендации: Используйте эту настройку, по крайней мере 8 часов сна.    
14=Примерное время ожидания: 7 - 9 часов
15=Настройки Обучения
16=Включить Закрытие СоС во время тренировки
17=Примерное время ожидания: 
18=часов
19=Включите эту опцию, чтобы заставить бота, закрыть СоС, когда обучение больше, чем 2 минуты, оставшиеся на время тренировки.
20=Рекомендации: Используйте этот параметр, чтобы сократить общее время, проведенное в Игре.
21=Доп. Время Мин: 
22=минут(ы)
23=Выберите минимальное количество минут, чтобы добавить в журнал для обучения.
24=Значение может быть от 0 до 30 минут.
25=Доп. Время Мах: 
26=минут(ы)
27=минут(ы)
28=минут(ы)
30=минут(ы)
31=минут(ы)
32=минут(ы)
34=минут(ы)
35=Выберите минимальное количество минут, чтобы добавить в журнал для обучения.
36=Значение может быть от 0 до 30 минут.
37=Ежедневные Настройки
38=Включить Лимит Атак
39=Включите этот параметр, чтобы ограничить максимальное количество атак в день.
40=Рекомендации: Используйте этот параметр, чтобы уменьшить кол-во атак в день.
41=Мин Атак: 
42=атака(и)
43=Выберите нижний предел диапазона макс атак.
44=Значение может быть от 0 до 25 атак.
45=Max Атак: 
46=атака(и)
47=Выберите верхний предел диапазона макс атак.
48=Значение может быть от 0 до 25 атак.
49=атака(и)
50=атака(и)
51=атака(и)
52=атака(и)
53=атака(и)
54=атака(и)
55=атака(и)
56=атака(и)
57=Оставьте CoC открытым или отключите для бездействия
58=Во время тренировки бот оставит CoC открытым или отключит для бездействия.
59=Закрыть CoC и остаться на главном экране
60=Во время тренировки бот закроет CoC и останется на главном экране.
61=Рандомно Открыть или Закрыть!
62=Рандомно Открывает или Закрывает игру.
63=Рандомно остаться в игре или закрыть во время тренировки
64=Рандомно остаться в игре и закрыть игру с вашими предыдущими настройками!

[7]
26=Переключение профилей
103=Добавить новый профиль
104=Применить
105=Удалить профиль
106=Отмена
107=Переименовать профиль
108=Профиль уже существует
109=Уже существует.
110=Пожалуйста, выберите другое имя для вашего профиля.
111=Удалить профиль
112=Вы уверены, что вы действительно хотите удалить профиль?
113=Это действие не может быть отменено.
114=Перезагрузите профиль, удалив все настройки.(Не рекомендуется)
115=<Нет Профиля>
1=Отключить заставку
2=Отключить заставку во время загрузки.

[11]
104=Топ Лут: 
102=Золото получено
103=Элексира получено
105=Дарка получено
106=Кубков получено

[50]
1=Количество поисков:
2=Количество поисков, оповещать каждые ____ поисков.  Если получать ошибки pushbullet или действуя смешно, увеличение прироста.  
3=Количество поисков, оповещать каждые ____ поисков.
4=Статист. Фарма:
5=Отправить Статистику Деревни каждые ____ атак..
45=Нет атак между обновлениями стат..

[1]
73=Опции бараков
74=Не пустые бараки
75=Бот не будет удалять существующие войска в казармах во время тренировки.
76=Режим заклинаний
77=Режим непрерывно варит заклинания.
78=Опции фабрики 
79=Тренировка больших войск первыми
80=Тренировка больших войск первыми(Например: Гигантов варит вторыми)
81=Тренировка больших войск первыми

[5]
1=Атаковать
2=Скорость задержки 
3=Нормальная скорость
4=Увеличение или уменьшение скорости, при которой атака сценария CSV развертывает войска и волны.
5=Увеличение или уменьшение скорости, при которой атака сценария CSV развертывает войска и волны.

[4]
1=Без лиги
2=Искать базу, которая без лиги..
3=Без лиги
4=Искать базу, которая без лиги..

[6]
1= && Сокровищ
2= и Сокровищ
3=Сбор сокровищ при мин. ресурсах
4=
5=Выставьте минимальное кол-во золота для бота, чтобы забирал из казны когда мало золота.
6=Выставьте минимальное кол-во Эликсир для бота, чтобы забирал из казны когда мало эликсира.
7=Выставьте минимальное кол-во Дарка для бота, чтобы забирал из казны когда мало Дарка.
8=Полная Казна
9=Отметьте флажком, если вы хотите чтобы бот собирал ресурсы когда Казна полная.

[3]
1=Хоп Кланы
2=Четыре Пальца Классика
[20]
21=Коллекторы снаружи
[2]
107=Коллект.снаружи
108=Поиск баз, которые имеют  коллекторы снаружи.
109=Мин: 
110=Введите Мин. % коллекторов снаружи для поиска и атаки на деревню.

[107]
1=Форекаст
2=Форекаст
3=Опции
4=Настройки
5=Сделайте перерыв, когда индекс<
6=Бот будет делать паузу, когда индекс падает ниже заданного значения.
7=Минимальный индекс Лута.
8=Не пустые бараки, если индекс ниже заданного значения
9=Не пустые бараки при каждом повторном подключении, если индекс ниже заданного значения.
10=Проверка индекса форекаста...
11=Буст
12=Буст только тогда когда индекс>
13=Буст Бараков,Фабрик или Героев(Не забутьте поставить буст во вкладке Бараки) 
14=Минимальный индекс Лута для Буста.
15=Переключение Профиля
16=Профиль
17=Когда Индекс <
18=Профиль
19=Когда Индекс >


[55]
1=: Быстрые ADB клики отключены (не поддерживается на этом Эмуляторе)
[17]
1=Мульти-Фарм
3=Переключить аккаунт для Атаки, а потом переключиться обратно 
4=Переключить аккаунт для Доната, а потом переключиться обратно 
5=Сколько использовать аккаунтов для Мульти-Фарма
2=Сколько:
22=Переключиться:
23=Переключить на второй Аккаунт
24=Переключить на третий Аккаунт
25=Переключить на четвёртый Аккаунт
26=Переключить на пятый Аккаунт
27=Переключить на шестой Аккаунт
28=Обнаружение текущего Аккаунта
29=Донат
30=Мульти-Фарм с интеллектуальным переключением

[68]
1=Телеграмма
2=Оповещение Телеграммы
3=Включить
4=Включить Оповещение Телеграммы
5=Удалённое Управление
6=Включить функцию Удалённое Управление Телеграммы
8=Для работы оповещения требуется токен, который можно получить на Telegram.org. Требуется регистрация.
7=Отправить сообщение Телеграммы:
30=/Stats- Отправить статистику Деревни.
9=Cтарт отправки оповещений Телеграммы.
28=Телеграмма: Ваш запрос был получен. Bot работает
29=Вы можете удалённо управлять ботом, посылая эти команды
31=/CampStatus - отправить текущий статус Деревни.
32=/Screenshot - отправить скриншот Деревни.
33=/LastRaidText - отправить статистиску последнего лута
34=/LastRaid - отправить скриншот последнего лута
35=/Stop - остановить бота
36=/Pause - пауза
37=/Restart - перезапустить бота и Android эмулятор
38=/Resume - перезапустить бота 
39=/Help - получить помощь (команды для управления оповещениями)
40=/Unsubscribe - Отмениить отправку оповещений.(Отмена всех оповещений)
41=/Delete - удалить все ваши предыдущие сообщения
42=/Log - отправить текущий лог-файл
43=Телеграмма: Ваш запрос был получен.Отправьте команду Help 

[67]
2=Статистика Доната
1=Статы Доната
4=Текущий Донат:
5=Остановить Донат:
6=Вкл
7=Сброс

[699]
52=Эта кнопка будет очищать или установливать весь столбец флажков
50=Новые
51=Только для новых обновлений для скорости
53=Вверх
54=Нажмите кнопку, чтобы переместить столбец со зданием вверх списка
55=Выше
56=Нажмите кнопку, чтобы переместить столбец со зданием вверх списка
 и проверки обновления здания 
57=Ниже
58=Нажмите кнопку, чтобы переместить столбец со зданием ниже и проверки зданий
59=Вниз
60=Нажмите кнопку, чтобы переместить столбец со зданием в самый низ и провереки здания в нижней части списка

[106]
1=Чат
2=Глобальный Чат
3=Реклама в глобальный чат
4=Используйте глобальный чат для отправки сообщений
5=Отправить в Глобальный Чат
6=Отправить кусочки сообщения, определенные в текстовых полях ниже, чтобы быть в произвольном порядке
7=Переключить язык
8=Переключение языков после написания для нового глобального чата
9=Задержка 
10=Задержка между отправкой сообщений в чат
11=Возьмите один кусок из этого списка (по одному в каждой строке) и добавьте его, чтобы создать сообщение для отправки в глобальный чат
12=Возьмите один кусок из этого списка (по одному в каждой строке) и добавьте его, чтобы создать сообщение для отправки в глобальный чат
13=Возьмите один кусок из этого списка (по одному в каждой строке) и добавьте его, чтобы создать сообщение для отправки в глобальный чат
14=Возьмите один кусок из этого списка (по одному в каждой строке) и добавьте его, чтобы создать сообщение для отправки в глобальный чат
15=Чат Клана
16=Написать в Клановый Чат
17=Используйте клановый чат для отправки сообщений
18=Используйте индивидуальный ответ
19=Используйте ключевые слова и ответы,ниже
20=Используйте ответы Cleverbot
21=Получите ответы от cleverbot.com
22=Используйте simsimi ответы
23=Получите ответы от simsimi.com
24=Используйте общие чаты
25=Используйте общий график чтения последнего чата 
26=Используйте PushBullet для общения
27=Отправка и получение чатов с помощью телеграммы. Используйте Открыть Чат <интервал | СООБЩЕНИЕ | СТОП>, чтобы получить последнее изображение чата клана, а также отправлять в чат <прямое сообщение> 
28=Уведомлять о новом клановом чате
29=Будет ли отправить изображение вашего клана чата через pushbullet, когда новый чат обнаружен. Не гарантируется точность 100%.
30=Посмотрите на заданные ключевые слова в клановых сообщениях, чтобы реагировать на ответы. Один из пунктов в каждой строке, в формате ключевого слова: ответ
31=Общие сообщения для отправки, по одному в строке
37=Чат Бот: Отправка в чат
41=Чат Бот: Отправка в глобальный чат
49=Чат Бот: Отправка завершена
38=Чат Бот: Отправка в чат
43=Чат Бот: Отправка в чат клана
46=Найдено сообщение чата: 
50=Чат Бот: отправка завершена
39=Отсрочка чата
40= больше времени
42=Чат Бот: Переключение языков
51=Для того, чтобы сообщения отправ. на русском в MEMU, измените язык ввода на русский. См. язык.png в папке с ботом.

[500]
1=Don't Run/Compile the Script as (x64)! Try to Run/Compile the Script as (x86) to get the bot to work.\r\nIf this message still appears, try to re-install AutoIt.
21=Initializing Android...
22=Detecting Android...
20=, Profile: %s
2=By using the commandline (or a shortcut) you can start multiple Bots:\r\n     MyBot.run.exe [ProfileName] [EmulatorName] [InstanceName]\r\n\r\nWith the first command line parameter, specify the Profilename (you can create profiles on the Misc tab, if a profilename contains a {space}, then enclose the profilename in double quotes). With the second, specify the name of the Emulator and with the third, an Android Instance (not for BlueStacks). \r\nSupported Emulators are MEmu, Droid4X, Nox, BlueStacks2 and BlueStacks.\r\n\r\nExamples:\r\n     MyBot.run.exe MyVillage BlueStacks2\r\n     MyBot.run.exe "My Second Village" MEmu MEmu_1
3=%s
4=%s (instance %s)
5=My Bot for %s is already running.\r\n\r\n
6=My Bot with Profile %s is already running in %s.\r\n\r\n
23=Loading Main GUI...
24=Loading GUI Bottom...
25=Loading General tab...
26=Loading Village tab...
27=Loading Attack tab...
28=Loading Bot tab...
29=Loading About Us tab...
30=Initializing GUI...
31=Show bot
32=Hide when minimized
33=Support Development
34=About
35=Exit
7=Found running %s %s
8=Android Emulator Configuration: %s
9=Android Shield not available for %s

[641]
1=Опции
2=Рандом
3=Включить Сон
4=Опция будет выйти из игры на время, необходимое для завершения подготовки войск, когда ЩИТ АКТИВЕН!
5=Закрытие для создания заклинаний будет включено, когда 'Ждать Заклинания' 
6=Закрыть для исцеления Герое будет включено, когда 'Ждёте Героев' 
7=Без щита
8=Опция будет всегда закрывать игру во время тренировки и когда НЕТ ЩИТА!
9=Примечание - Вы можете быть атакованы и потерять трофеи, когда эта опция включена!
13=Закрытие Эмуля
14=Опция закроет Эмулятор полностью
15=Добавление этого параметра может увеличить время нахождения в офлайн
10=Рандом Закрытие
11=Опция будет рандомно закрывать игру или эмулятор 
16=Точное время
17=Выберите ждать точное время, необходимое для  тренировки войск
18=Выберите, сколько времени ждать, когда функция включина
19=Рандомное Время
20=Выберите, чтобы добавить случайное дополнительное время ожидания, как человек.
21=Введите максимальный процент дополнительного времени, чтобы использовать создание рандомного времени ожидания,
22=Бот будет вычислять случайное время ожидания между точным временем, необходимым, и
23=максимальным 
25=Тренировка
26=Войска за Элик
27=Включить, чтобы выбрать пользовательский  порядок подготовки войск за Элик.
28=Изменение порядка тренировки может быть полезным с CSV атаки!
29=Выберите порядок тренировки войск#
30=Применить
31=Нажмите кнопку, когда закончите выбор 
32=Значок меняет цвет в зависимости от статуса: Красный = Не указан, Зеленый = Указан
33=Войска за Дарк
34=Включить, чтобы выбрать пользовательский  порядок подготовки войск за Дарк.
35=Training Add Random Delay
36=Add Random Delay
37=Add random delay between two calls of train army.
38=This option reduces the calls to the training window  humanizing the bot spacing calls each time with a causal interval chosen between the minimum and maximum values indicated below.
39=Between
40=And
41=sec.

[110]
1=CoCСтаты 
2=Активация отправки статистики фарма на CoCStats.com
3=API Ключ:
4=Зайдите на CoCStats.com и введите сюда полученый там API Ключ 

[605]
1=Молния
2=Хилл
3=Ярость
4=Прыгучее
5=Заморозка
6=Яд
7=Землятрясущее
8=Ускорение
9=Яд
10=Землятряс
11=Ускорение
12=Клонирующие
13=Скелетное
14=Скелетное
